
def d1 ():
        input("Введите кратчайшее расстояние между спасателем и кромкой воды, d1 (ярды):")
def d2():
        input("Введите кратчайшее расстояние от утопающего до берега, d2 (футы): ")
def h():
        input("Введите боковое смещение между спасателем и утопающим, h (ярды): ")
def v_sand():
        input("Введите скорость движения спасателя по песку, v_sand (мили в час):  ")
def n():
      input("Введите коэффициент замедления спасателя при движении в воде,: ")
def theta1():
     input("Введите направление движения спасателя по песку,: ")
